Тест_ЗУП_31_КОРП/src/Catalogs/ВидыИнструктажейПоОхранеТруда/ВидыИнструктажейПоОхранеТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыИнструктажейПоОхранеТруда</name>
  <predefined>
    <items>
      <name>Вводный</name>
      <description>Вводный</description>
    </items>
  </predefined>
  <attributes>
    <name>КонтролироватьПроведениеИнструктажа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитсяПовторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляВсехРабочихМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ВидыИнструктажейПоОхранеТруда/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное видов происшествий.
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЗначениеИстина
	|ИЗ
	|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
	|ГДЕ
	|	ВидыИнструктажейПоОхранеТруда.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыИнструктажейПоОхранеТруда.Вводный)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	// Вводный
	ВидИнструктажаОбъект = Справочники.ВидыИнструктажейПоОхранеТруда.Вводный.ПолучитьОбъект();
	ВидИнструктажаОбъект.КонтролироватьПроведениеИнструктажа = Истина;
	ВидИнструктажаОбъект.ПроводитсяПовторно = Ложь;
	ВидИнструктажаОбъект.ИспользоватьДляВсехРабочихМест = Истина;
	ВидИнструктажаОбъект.Записать();
	
	// На рабочем месте (первичный и повторный)
	ВидИнструктажаОбъект = Справочники.ВидыИнструктажейПоОхранеТруда.СоздатьЭлемент();
	ВидИнструктажаОбъект.Наименование = НСтр("ru = 'На рабочем месте (первичный и повторный)'");
	ВидИнструктажаОбъект.КонтролироватьПроведениеИнструктажа = Истина;
	ВидИнструктажаОбъект.ПроводитсяПовторно = Истина;
	ВидИнструктажаОбъект.ИспользоватьДляВсехРабочихМест = Истина;
	ВидИнструктажаОбъект.КоличествоРаз = 1;
	ВидИнструктажаОбъект.КоличествоПериодов = 1;
	ВидИнструктажаОбъект.Периодичность = Перечисления.Периодичность.Месяц;
	ВидИнструктажаОбъект.Записать();
	
	// Внеплановый
	ВидИнструктажаОбъект = Справочники.ВидыИнструктажейПоОхранеТруда.СоздатьЭлемент();
	ВидИнструктажаОбъект.Наименование = НСтр("ru = 'Внеплановый'");
	ВидИнструктажаОбъект.ИспользоватьДляВсехРабочихМест = Истина;
	ВидИнструктажаОбъект.Записать();
	
	// Целевой
	ВидИнструктажаОбъект = Справочники.ВидыИнструктажейПоОхранеТруда.СоздатьЭлемент();
	ВидИнструктажаОбъект.Наименование = НСтр("ru = 'Целевой'");
	ВидИнструктажаОбъект.ИспользоватьДляВсехРабочихМест = Истина;
	ВидИнструктажаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
